Tekla Open API Reference for Tekla Structures 2025
BentPlateGeometrySolver.ModifyRadius Method
 Modify the radius of a cylindrical section.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ConnectiveGeometry ModifyRadius(
	ConnectiveGeometry geometry,
	GeometrySection cylindricalSection,
	double radius
)
Public Function ModifyRadius (
	geometry As ConnectiveGeometry,
	cylindricalSection As GeometrySection,
	radius As Double
) As ConnectiveGeometry
Parameters
geometry
Type: Tekla.Structures.Model.ConnectiveGeometry
Reference geometry to modify which contains cylindricalSection.
cylindricalSection
Type: Tekla.Structures.Model.GeometrySection
The cylindrical geometry section to modify.
radius
Type: System.Double
The new radius for the cylindrical section.
Return Value
Type: ConnectiveGeometry
Modified ConnectiveGeometry if command succeeded or geometry otherwise.
Exceptions
Exception | Condition
ConnectiveGeometryException | Thrown if could not modify radius.
See Also
Reference
BentPlateGeometrySolver Class
Tekla.Structures.Model Namespace